#include <stdio.h>

int main(){
	double arr1[5] = {88.99, 100.12, 59.45, 183.11, 340.5};
	double arr2[5] = {88.99, 100.12, 59.45, 183.11, 340.5};
	int arr3[4][2] = {{1, 2}, {3, 4}, {5, 6}, {7, 8}};

	double* const ptr1 = arr1; // константный указатель
	//ptr1 = &rates[2]; // нельзя изменить указатель (адрес)
	*ptr1 = 92.99; // можно изменить значение по этому адресу
	printf("arr1[0] changed = %lf\n", arr1[0]);

	const double* ptr2 = arr1; // указатель на константу
	printf("ptr2 = %p\n", ptr2);
	//*ptr2 = 92.99; // нельзя изменить содержимое
	ptr2 = &arr1[1]; // можно изменить указатель (адрес)
	printf("ptr2 changed = %p\n\n", ptr2);

	printf("arr3 = %p\n", arr3); // адрес самого массива (адрес первого элемента первого массива)
	printf("&arr3[0] = %p\n", &arr3[0]); // аналогично первому (если указать &arr3[1], то будет указывать на адрес второго массива)
	printf("arr3[0] = %p\n", arr3[0]); // адрес первого массива
	printf("&arr3[0][0] = %p\n", &arr3[0][0]); // адрес первого элемента первого массива
	printf("arr3 + 1 = %p\n", arr3 + 1); // указывает на первое значение второго массива (на адрес цифры 3)
	printf("arr3[0] + 1 = %p\n\n", arr3[0] + 1); // указывает на второе значение в первом массиве (на цифру 2)
	printf("*arr3[0] = %p\n", *arr3[0]); // значение первого элемента первого массива (arr[0][0])
	printf("*arr3 = %p\n\n", *arr3); // разыменование arr3 представляет значение первого элемента (arr3[0]), но он сам является адресом
	printf("**arr3 = %p\n", **arr3);
	printf("*&arr3[0][0] = %p\n\n", *&arr3[0][0]);

	int zippo[4][2] = {{2,4}, {6,8}, {1,3}, {5,7}}; 
	int (*pz)[2]; 
	pz = zippo;
	printf("pz = %p, pz + 1 = %p\n", pz, pz + 1);
	printf("pz[0] = %p, pz[0] + 1 = %p\n", pz[0], pz[0] + 1);
	printf("*pz = %p, *pz + 1 = %p\n", *pz, *pz + 1);
	printf("pz[0][0] = %d\n", pz[0][0]);
	printf("*pz[0] = %d\n", *pz[0]);
	printf("**pz = %d\n", **pz);
	printf("pz[2][1] = %d\n", pz[2][1]);
	printf("*(*(pz + 2) + 1) = %d\n\n", *(*(pz + 2) + 1));

	int* ptr12;
	int torf[2][2] = {12, 14, 16}; 
	ptr12 = torf[0];
	printf("*ptr12 = %d, *(ptr12 + 2) = %d\n", *ptr12, *(ptr12 + 2));
	int* ptr22;
	int fort[2][2] = {{12}, {14, 16}}; 
	ptr22 = fort[0];
	printf("*ptr22 = %d, *(ptr22 + 2) = %d", *ptr22, *(ptr22 + 2));
	return 0;
}